#include <stdio.h>
int arr[50000];//ปกติเเล้วอาจจะไม่กำหนดเยอะเท่านี้เพราะโจทย์กำหนดให้ N ไม่เกิน 1M
void main()
{
    int N,fraction,count=0;//N = ค่าที่รับเข้ามา ,faction = เศษ , count = จำนวนหลักของเลขฐาน 2
    scanf("%d",&N);//รับค่า N
    for(int i=0;1;i++)//ลูปอนันต์
    {
        if(N==0)//ถ้า N==0 ให้จบลูป
        {
            break;
        }
        fraction = N%2; //เศษจากการหารด้วย 2
        N = N/2; // จำนวนที่ 2 หารได้
        arr[i] = fraction; //เเทนค่า
        count++; //นับหลัก
    }
    for(int i=count-1;i>=0;i--)// เลียงจากข้างหลังไปข้างหน้า <<count -1 เพราะโปรเเกรมนับ 0 เป็นลำดับเเรก>>
    {
        printf("%d",arr[i]); //เเสดงผล
    }
}
